---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCAggregateIterator
source: html/3a89e724-75b2-8dac-41e3-2bc1654a7888.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregateIterator

A class used to iterate individual objects in an IFCAggregate.

## Syntax (C#)
```csharp
public class IFCAggregateIterator : IEnumerator<IFCData>
```